Repository: Vistaus/forgetpass
Catalog: po/*.po
Languages: be, tr, uk_ua

source: Simple password generator for websites
be: Просты генератар пароляў для сайтаў
tr: Web siteleri için basit şifre oluşturucu
uk_ua: Простий генератор паролів для веб-сайтів

source: Password;Manager;Security;Generate;Derive;
be: Password;Manager;Security;Generate;Derive;Пароль; Менеджэр; Бяспека; Стварыць; Вывесці;
tr: Şifre;Parola;Yönetici;Güvenlik;Oluştur;Türet;
uk_ua: Password;Manager;Security;Generate;Derive;пароль;безпека;генерувати;створити;згадати;сайт;менеджер;пассворд;секрет;

source: You don't need to remember passwords anymore! All you need is a website name and a keyword that is easy to remember. The program will generate a strong password, and if you need it again, just enter the above data and you will get the same password.
be: Вам больш не трэба запамінаць паролі! Усё, што вам трэба, гэта назва вэб-сайта і ключавое слова, якое лёгка запомніць. Праграма згенеруе надзейны пароль, і калі ён вам спатрэбіцца зноў, проста ўвядзіце даныя вышэй, і вы атрымаеце той жа пароль.
tr: Artık parolaları hatırlamanıza gerek yok! Tek ihtiyacınız olan web sitesinin adı ve hatırlaması kolay bir anahtar sözcük. Program güçlü bir parola oluşturacak ve tekrar ihtiyacınız olduğunda yukarıdaki verileri girmeniz yeterli olacaktır. Böylece aynı parolayı alabilirsiniz.
uk_ua: Вам не потрібно більше запам'ятовувати паролі! Все що вам треба - назва сайту і ключове слово які легко запам'ятати. Програма згенерує надійний пароль, і якщо вам знову знадобиться, просто введіть ці дані знову і ви отримаєте той же пароль.

source: Site
be: Сайт
tr: Web sitesi
uk_ua: Сайт

source: Use only the domain name without prefixes, such as http or www, and endings, such as .com, etc.
be: Выкарыстоўвайце толькі даменнае імя без прэфіксаў, напрыклад http або www, і канчаткаў, такіх як .com і г.д.
tr: http veya www gibi ön ekler ve .com gibi son ekler olmadan alan adını kullanın.
uk_ua: Використовуйте тільки назву домену без префіксів як http або www, і без закінченнь як .com

source: Keyword
be: Ключавое слова
tr: Anahtar sözcük
uk_ua: Ключове слово

source: Be sure to remember the keyword! If you forget it, you won't be able to recover your password!
be: Абавязкова запомніце ключавое слова! Калі вы забудзеце яго, вы не зможаце аднавіць пароль!
tr: Anahtar sözcüğü hatırladığınızdan emin olun! Eğer unutursanız, paralonazı kurtarmanız mümkün olmayacaktır!
uk_ua: Запам'ятайте це ключове слово! Якщо ви його забудете, ви не зможете відновити пароль!

source: GENERATE
be: СТВАРЫЦЬ
tr: Oluştur
uk_ua: ЗГЕНЕРУВАТИ

source: Copy password
be: Скапіраваць пароль
tr: Parolayı kopyala
uk_ua: Скопіювати пароль

source: Enter the name of the site
be: Увядзіце назву сайта
tr: Web sitesinin adını girin
uk_ua: Введіть назву сайту

source: Enter a keyword
be: Увядзіце ключавое слова
tr: Anahtar sözcük girin
uk_ua: Введіть ключове слово

source: ERROR!!! Failed to generate password
be: ПАМЫЛКА!!! Не ўдалося стварыць пароль
tr: HATA!!! Parola oluşturulamadı
uk_ua: Помилка! Не вдалося згенерувати пароль

source: _OK
be: _ОК
tr: _Tamam
uk_ua: _Добре
